---

C#Visual BasicVisual C++

Revit 2024 API
---
LoadCombination..::..Create Method (Document, String)
LoadCombination Class See Also Send Feedback
---

Creates a new default LoadCombination.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016

# Syntax

C#
---

    public static LoadCombination Create(
    	Document document,
    	string name
    )

Visual Basic
---

    Public Shared Function Create ( _
    	document As Document, _
    	name As String _
    ) As LoadCombination

Visual C++
---

    public:
    static LoadCombination^ Create(
    	Document^ document,
    	String^ name
    )

#### Parameters

document
    Type: Autodesk.Revit.DB..::..Document The Document to which new load combination element will be added.

name
    Type: System..::..String The name of the load combination.

#### Return Value

The newly created load combination element if successful, nullNothingnullptra null reference (Nothing in Visual Basic) otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given name is not unique |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also

LoadCombination Class

Create Overload

Autodesk.Revit.DB.Structure Namespace